{
  "backend/main.mo": "Empty Motoko actor placeholder.",
  "feature_evidence.json": "Feature evidence report listing SVG converter feature IDs, titles, related files, components, and tests.",
  "frontend-file-summaries.txt": "Prewritten summaries describing each frontend source file's purpose.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH color variables and light/dark theme tokens.",
  "frontend/index.html": "HTML entry point containing root div and script loading the frontend app.",
  "frontend/src/App.tsx": "Main React app wrapper with theme provider, header, converter section, and footer.",
  "frontend/src/components/ConverterSection.tsx": "Handles SVG path input, independent path/polygon conversion, error tracking, and preview/output layout.",
  "frontend/src/components/Footer.tsx": "Footer displaying copyright and caffeine.ai attribution.",
  "frontend/src/components/Header.tsx": "Sticky header showing app title, description, and scissors icon.",
  "frontend/src/components/InputSection.tsx": "Provides text and file-based SVG path input with quality selector and error display.",
  "frontend/src/components/OutputSection.tsx": "Shows converted path() and polygon() outputs with copy buttons and format-specific errors.",
  "frontend/src/components/PreviewSection.tsx": "Renders SVG and clip-path previews with tabs for input/output and path/polygon formats, handling errors and missing outputs.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on Internet Identity, invalidating related queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication state and actions using Internet Identity, managing AuthClient creation, login, and stored identity restoration.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file indicating backend queries are not needed.",
  "frontend/src/index.css": "Defines Tailwind base layers and theme variables for light/dark modes with custom OKLCH color tokens.",
  "frontend/src/lib/pathConverter.ts": "Converts SVG paths to CSS clip-path path() or polygon() formats, including validation, tokenization, and curve/arc flattening.",
  "frontend/src/main.tsx": "Bootstraps the app with React, wrapping it in query and identity providers.",
  "frontend/tailwind.config.js": "Tailwind config extending colors, utilities, animations, and enabling typography, container queries, and animation plugins.",
  "project_state.json": "Defines the project’s current state, features, and known issues for an SVG‑to‑CSS clip‑path converter tool, highlighting broken polygon conversion and UI/preview requirements. Serves as a structured specification guiding fixes and feature updates."
}